app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG')  ORDER BY release_date desc
---
    def index
      reconcile_session
      @all_ratings = Movie.all_ratings
      @ratings_selected = params[:ratings].nil? ? @all_ratings.to_a : params[:ratings].keys